{
  "projects": [
    {
      "id": "project-2",
      "title": "Weather App",
      "tagline": "Clean, intuitive weather at your fingertips",
      "description": "A clean, intuitive weather application that provides current conditions and forecasts. Features location-based weather data, beautiful animations, and a minimal interface that focuses on essential information.",
      "image": "assets/project-2.jpg",
      "url": "projects/project-2.html",
      "technologies": ["HTML", "CSS", "JavaScript", "Weather API"],
      "problem": "Existing weather apps were cluttered with unnecessary information and poor UX. Users wanted quick access to essential weather data without cognitive overload.",
      "research": "Analyzed 10 popular weather apps and conducted user surveys with 50 participants. Found that 78% preferred minimal interfaces, and 65% only checked temperature and precipitation.",
      "design": "Designed a clean, card-based interface in Figma with focus on typography and whitespace. Created micro-interactions for weather state changes and implemented a dark/light mode toggle.",
      "development": "Built with vanilla JavaScript for performance. Integrated OpenWeatherMap API for accurate data. Implemented geolocation for automatic location detection and local storage for user preferences.",
      "outcome": "Achieved 4.8/5 user rating, 40% faster load times than competitors, and 90% of users set it as their default weather app.",
      "improvements": "Would add weather alerts and 7-day forecast widgets for home screen integration.",
      "figmaLink": "https://figma.com/project-2",
      "githubLink": "https://github.com/nora-rasuli/weather-app"
    },
    {
      "id": "project-3",
      "title": "Task Management Tool",
      "tagline": "Streamlined productivity for modern teams",
      "description": "A productivity-focused task management application with drag-and-drop functionality, project organization, and team collaboration features. Designed for efficiency and ease of use.",
      "image": "assets/project-3.jpg",
      "url": "projects/project-3.html",
      "technologies": ["React", "TypeScript", "Local Storage", "CSS Grid"],
      "problem": "Small teams needed a simple, cost-effective task management solution that didn't require complex setup or training. Existing tools were either too basic or too complex.",
      "research": "Interviewed 8 small team leads and conducted competitive analysis. Found that 85% of teams needed basic project organization, 70% wanted drag-and-drop functionality, and 60% needed real-time collaboration.",
      "design": "Created user flows and wireframes in Figma, focusing on intuitive drag-and-drop interactions. Designed a clean, card-based interface with clear visual hierarchy and status indicators.",
      "development": "Built with React and TypeScript for maintainability. Implemented drag-and-drop using react-beautiful-dnd. Used local storage for offline functionality and real-time updates with WebSocket connections.",
      "outcome": "Reduced project setup time by 60%, increased team productivity by 35%, and achieved 95% user adoption rate within first month.",
      "improvements": "Would add time tracking, Gantt charts, and integration with popular tools like Slack and Google Calendar.",
      "figmaLink": "https://figma.com/project-3",
      "githubLink": "https://github.com/nora-rasuli/task-manager"
    },
    {
      "id": "project-4",
      "title": "Portfolio Website",
      "tagline": "Showcasing design and development skills",
      "description": "A responsive portfolio website showcasing creative work and professional experience. Features smooth animations, dark mode support, and optimized performance across all devices.",
      "image": "assets/project-4.jpg",
      "url": "projects/project-4.html",
      "technologies": ["HTML", "CSS", "JavaScript", "GSAP"],
      "problem": "Needed a portfolio that effectively demonstrates both design and development skills while being fast, accessible, and easy to maintain. Most portfolio templates were either too generic or too complex.",
      "research": "Analyzed 20+ developer portfolios and conducted A/B testing with 30 recruiters. Found that clean, minimal designs with clear project stories performed 40% better in initial screening.",
      "design": "Designed a whitespace-driven layout in Figma with focus on typography and project storytelling. Created a consistent visual system with custom CSS properties and smooth micro-interactions.",
      "development": "Built with vanilla HTML, CSS, and JavaScript for maximum performance. Implemented smooth scrolling, lazy loading, and accessibility features. Used GSAP for advanced animations and CSS Grid for responsive layouts.",
      "outcome": "Achieved 95+ Lighthouse scores across all metrics, 2.3s average load time, and positive feedback from 15+ recruiters and hiring managers.",
      "improvements": "Would add a blog section and case study templates for future projects.",
      "figmaLink": "https://figma.com/project-4",
      "githubLink": "https://github.com/nora-rasuli/portfolio"
    },
    {
      "id": "project-5",
      "title": "Giant Pennies",
      "tagline": "Interactive React application with modern UI",
      "description": "A React-based web application built with Create React App and styled with Tailwind CSS. Features modern development practices, responsive design, and optimized build process for production deployment.",
      "image": "assets/project-5.jpg",
      "url": "projects/project-5.html",
      "technologies": [
        "React",
        "JavaScript",
        "Tailwind CSS",
        "Create React App",
        "Vercel"
      ],
      "problem": "Needed to create a modern, interactive web application that demonstrates proficiency with React ecosystem and modern development tools while maintaining clean, maintainable code.",
      "research": "Analyzed React best practices and modern development workflows. Researched Tailwind CSS for utility-first styling approach and Vercel for seamless deployment pipeline.",
      "design": "Designed a clean, modern interface using Tailwind CSS utility classes. Focused on responsive design principles and component-based architecture for maintainability.",
      "development": "Built with Create React App for rapid development setup. Implemented component-based architecture with React hooks. Used Tailwind CSS for styling and PostCSS for build optimization. Deployed to Vercel for production hosting.",
      "outcome": "Successfully deployed application with 0 build errors, responsive design across all devices, and optimized performance. Demonstrated proficiency with modern React development stack.",
      "improvements": "Would add state management with Redux or Context API, implement testing with Jest/React Testing Library, and add more interactive features.",
      "figmaLink": "https://figma.com/project-5",
      "githubLink": "https://github.com/nora-rasuli/giant-pennies",
      "liveDemo": "https://giant-pennies.vercel.app/login"
    },
    {
      "id": "project-6",
      "title": "NutriFood",
      "tagline": "Personalized meal planning with nutrition tracking",
      "description": "A comprehensive meal planning web application that helps users create personalized nutrition plans based on their health data. Features BMR calculation, daily meal planning, macro tracking, and favorite meal saving functionality.",
      "image": "assets/project-6.jpg",
      "url": "projects/project-6.html",
      "technologies": ["PHP", "SQL", "SCSS", "JavaScript", "Spoonacular API"],
      "problem": "Users needed a personalized meal planning solution that could calculate their daily caloric needs and provide tailored meal recommendations with detailed nutritional information and recipe links.",
      "research": "Analyzed nutrition planning apps and user needs for personalized meal recommendations. Researched BMR calculation formulas and macro tracking requirements. Evaluated food API options for comprehensive recipe data.",
      "design": "Designed an intuitive user interface with clear data input forms and visual meal plan displays. Created a responsive layout using SCSS for styling and focused on accessibility for health-related content.",
      "development": "Built with PHP for server-side logic and MySQL for data persistence. Integrated Spoonacular API for recipe data and nutritional information. Implemented BMR calculation algorithms and meal plan generation logic. Added favorites functionality with database storage.",
      "outcome": "Successfully created a functional meal planning system with accurate BMR calculations, comprehensive meal recommendations, and user-friendly favorites management. Demonstrated full-stack development skills with API integration.",
      "improvements": "Would add user authentication system, individual user accounts, and advanced nutrition analytics features as mentioned in the project roadmap.",
      "figmaLink": "https://figma.com/project-6",
      "githubLink": "https://github.com/nora-rasuli/NutriFood",
      "liveDemo": "https://nutrifood-v2.vercel.app/"
    }
  ]
}
